'''
    填字游戏2
    1.随机输出列表中的成语，同时将成语进行随机位置输出空格，
        要求用户填写答案，敲击回车键，程序可以判断是否正确，
        正确输出“正确，你真棒！”；错误输出“错了，正确答案：”；所有答完成语退出程序
    2.输出结果如下：
        =======成语填填乐=======
                自__为是
                输入：由
                错了,正确答案： 以
                山清__秀
                输入：爱
                错了,正确答案： 水
                千军__马
                输入：
'''
import random

list = ["春暖花开", "十字路口", "千军万马", "白手起家", "张灯结彩", "风和日丽", "万里长城",
        "人来人往", "自由自在", "瓜田李下", "助人为乐", "白手起家", "红男绿女", "春风化雨",
        "马到成功", "拔苗助长", "安居乐业", "走马观花", "念念不忘", "落花流水", "张灯结彩",
        "一往无前", "落地生根", "天罗地网", "东山再起", "一事无成", "山清水秀", "别有洞天",
        "语重心长", "水深火热", "鸟语花香", "自以为是"]
print("=======成语填填乐=======\n")


def idiom(ask):
    while len(list) > 0:
        item = random.choice(ask)
        bank = random.randint(0, 3)
        new = item[:bank] + "__" + item[bank + 1:]
        print(new)
        num = input("输入：")
        if num.strip(" ") == item[bank]:
            print("正确,你真棒！")
            list.remove(item)
        else:
            print("错了,正确答案：", item[bank])
            list.remove(item)


idiom(list)
print("恭喜你完成本轮成语填填乐")
