'''
    填字游戏3
    1.随机输出一条包含一个空格的成语，填写完答案，回车，程序可以判断是否正确。
      正确加2分，输出“正确，你真棒！”；错误减2分，输出“错了，正确答案：”；
      什么也不填忽略本成语，输出“过”。
      本游戏一共3关，游戏完成输出成绩，选手原始分数为20分。
    2.输出结果如下：
            成语填填乐
            直接填写答案，回车进入下一关。什么也不填忽略本成语！
            东山__起
            输入：再
            正确,你真棒！
            春风__雨
            输入：化
            正确,你真棒！
            落地__根
            输入：归
            错了,正确答案： 生
            选手最后得分： 22
'''
import random

list = ["春暖花开", "十字路口", "千军万马", "白手起家", "张灯结彩", "风和日丽", "万里长城",
        "人来人往", "自由自在", "瓜田李下", "助人为乐", "白手起家", "红男绿女", "春风化雨",
        "马到成功", "拔苗助长", "安居乐业", "走马观花", "念念不忘", "落花流水", "张灯结彩",
        "一往无前", "落地生根", "天罗地网", "东山再起", "一事无成", "山清水秀", "别有洞天",
        "语重心长", "水深火热", "鸟语花香", "自以为是"]
print("成语填填乐\n")


def idiom(ask, count):
    i = 1
    print('直接填写答案，回车进入下一关。什么也不填忽略本成语！')
    while True:
        word = random.choice(ask)
        bank = random.randint(0, 3)
        new = word[:bank] + "__" + word[bank + 1:]
        print(new)
        num = input("输入：")
        if not num:
            print("过！")
            continue
        elif num.strip(" ") == word[bank]:
            count += 2
            print("正确,你真棒！")
        else:
            count -= 2
            print("错了,正确答案：", word[bank])
        i += 1                     # 定义计算器,表示第几关
        if i > 3:                  # 如果小于第三关,则返回得分
            return count


print("选手最后得分：", idiom(list, 20))
