'''
    填字游戏1
    1.按列表中成语的顺序输出第一个字为空格的成语，
     要求用户填写答 案并回车可以判断是否正确。
     正确输出“正确，你真棒！”；错误输出“错了，正确答案：”
    2.输出结果如下：
        =======成语填填乐=======
            __暖花开
            输入：爱
            错了,正确答案 春
            __字路口
            输入：十
            正确,你真棒！
            __军万马
            输入：
'''
list = ["春暖花开", "十字路口", "千军万马", "白手起家", "张灯结彩", "风和日丽", "万里长城",
        "人来人往", "自由自在", "瓜田李下", "助人为乐", "白手起家", "红男绿女", "春风化雨",
        "马到成功", "拔苗助长", "安居乐业", "走马观花", "念念不忘", "落花流水", "张灯结彩",
        "一往无前", "落地生根", "天罗地网", "东山再起", "一事无成", "山清水秀", "别有洞天",
        "语重心长", "水深火热", "鸟语花香", "自以为是"]
print("=======成语填填乐=======\n")


def idiom(ask):
    for item in ask:
        new = "__" + item[1:]
        print(new)
        num = input("输入：")
        if num.strip(" ") == item[0]:
            print("正确,你真棒！")
        else:
            print("错了,正确答案", item[0])


idiom(list)
