'''
    1.身份证第17位数分别乘以系数
        ["7","9","10","5","8","4","2","1","6","3","7","9","10","5","8","4","2"]
    2.乘后的结果相加，最后除以11,余数为 0、1、2、3、4、5、6、7、8、9、10
      对应身份证最后一位数“10X98765432”
    3.将15位数的身份证转换成18位新的身份证

    (a).220105 0307 0  5  1  2  2
        012345 6789 10 11 12 13 14 15 16
    (b).220105 19 03  0 7   0  5  1  2  2
        012345 67 89 10 11 12 13 14 15 16 17 18
'''

# 1.将15转为18位数，增加年份19
OrderCard=["220105030705122","220102310523023","110105431208031","560110781120989"]
syst=["7","9","10","5","8","4","2","1","6","3","7","9","10","5","8","4","2"]
last="10X98765432"
for item in OrderCard:
    print('老版十五位身份证为：',item)
    new17=item[:6]+'19'+item[6:]
    add=0
    for i in range(17):
        add+=int(new17[i])*int(syst[i])
    lea=add%11
    new18=new17+last[lea]
    print('新版十八位身份证为：',new18)


