'''
    彩票抽奖6
    1.从0000000-9999999的7位排列号码中选择一组作为单式投注。单张彩票选择多组为复式投注,最大投注数量限10000注
        将你的生日作为彩票的固定数，随机生成10注七星彩彩票。如生日为3月12日
    2.输出结果如下：
        ------体彩七星彩----------
        =========================
        请输入你的生日(如2-12)：312
        3124252
        3123120
        3127881
        3128337
        3128964
        3129702
        3124444
        3120751
        3129491
        3121976
'''
import random

print("------体彩七星彩----------")
print("=========================")
birth = input("请输入你的生日(如2-12)：")
num = ""
alls = "9999999"
for item in birth:
    if item.isdigit():
        num += str(item)
for i in range(10):
    lens = 7 - len(num)
    print(num + str(random.choice(range(0, int(alls[0:lens])))).zfill(lens))
