'''
    彩票抽奖2
    1.彩票双色球每注2元,每注投注号码由6个红色球号码和1个蓝色球号码组成。
    2.红色球号码从1-33中选择,蓝色球号码从1-16中选择,输出产生一注福彩双色球
    3.输出结果如下：
            ***福彩双色球***
            ================
            03,19,07,10,04,12,16
    4.知识点回顾：
        range()：用于生成指定范围的整数。
        random.choice()：指定序列中返回一个随机的元素。
        random.sample()：指定序列中随机获取指定长度的片段。
        zfill()：指定长度的字符串,原字符右对齐,前面填0.
        join()：将序列中的元素以连接符连接成一个新的字符串。
'''
import random

print("***福彩双色球***")
print("================")
red = [str(i).zfill(2) for i in (random.sample(range(1, 34), 6))]
print(','.join(red) + "," + str(random.choice(range(1, 17))).zfill(2))
