'''
   1.国家统计局的数据显示：“王李张刘陈杨黄赵吴周徐孙马胡朱郭何罗高林”为全国前20大姓氏，读取新百家姓文
       件 bjx_per.txt。列图标(☺，chr(9786))排行输出排名前十的姓氏.
   2.输出结果如下：
        王	☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺
        李	☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺
        张	☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺
        刘	☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺
        陈	☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺
        杨	☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺☺
        黄	☺☺☺☺☺☺☺☺☺☺☺☺☺☺
        赵	☺☺☺☺☺☺☺☺☺☺☺☺☺
        周	☺☺☺☺☺☺☺☺☺☺☺☺
        吴	☺☺☺☺☺☺☺☺☺☺☺
'''

bjx_sort = []
base = 200
with open('E://06_workspace//jobspace//pythonDemo//tmp//bjx_per.txt', 'r', encoding='UTF-8') as file:
    while True:
        line = file.readline()
        if line == '':
            break
        new = line.split(" ")
        bjx_sort.append([new[1], new[2]])
for i in range(1, 11):
    print(bjx_sort[i][0] + "\t" + int(int(bjx_sort[i][1]) / base) * chr(9786))
