'''
    1.将新版的18位身份证中第6位到12位打码
    2.输出结果：
        老版十五位身份证为： 220105030705122
        新版十八位身份证为： 220105190307051223
        老版十五位身份证为： 220102310523023
        新版十八位身份证为： 220102193105230236
        老版十五位身份证为： 110105431208031
        新版十八位身份证为： 110105194312080312
        老版十五位身份证为： 560110781120989
        新版十八位身份证为： 560110197811209895
        打码后的身份证为:
                220105******051223
                220102******230236
                110105******080312
                560110******209895
    3.切片分析
            560110 1978 1   1  2  0  9  8 9   5
            012345 6789 10 12 13 14 15 16 17 18
            560110 **** *   *  2  0  9  8 9   5

'''
OrderCard=["220105030705122","220102310523023","110105431208031","560110781120989"]
syst=["7","9","10","5","8","4","2","1","6","3","7","9","10","5","8","4","2"]
last="10X98765432"
new_order=[]
for item in OrderCard:
    print("老版十五位身份证为：",item)
    new17=item[:6]+"19"+item[6:]
    add=0
    for i in range(17):
        add+=int(new17[i])*int(syst[i])
    lea=add%11
    new18=new17+last[lea]
    print("新版十八位身份证为：",new18)
    new_order.append(new18)

# 方式一:
# print("打码后的身份证为:")
#
# for itam in new_order:
#    print(itam[0:6]+"******"+itam[12:])

# 方式二：简化方式一使用推导式实现
print("打印后的身份证为：")
[print(itam[0:6]+"******"+itam[12:]) for itam in new_order]



