'''
    1.读取sfzdm.txt文件的身份证信息，
        然后按身份证信息的前两位排序，并按省输出和保存读取的身份证信息。
    2.省、直辖市和自治区字典信息：
        info={'11':'北京市','12':'天津市','13':'河北省','14':'山西省','15':'内蒙古自治区
            ','22':'吉林省','23':'黑龙江省','31':'上海市', '32':'江苏省','33':'浙江省','35':'福建
            省','36':'江西省','37':'山东省','41':'河南省','42':'湖北省','44':'广东省','45':'广西壮
            族自治区','46':'海南省','50':'重庆市','51':'四川省','53':'云南省','54':'西藏自治区
            ','61':' 陕西省 ','62':' 甘肃省 ','63':' 青海省 ','65':' 新疆维吾尔自治区 ','71':' 台湾省
            ','81':'香港','82':'澳门' }
    3.输出格式如下：
              河北省
        130200******219671
        130638******251643
        131181******220799
              山西省
        140212******147273
        140600******229863
        140729******185841
        141022******038575
              吉林省
        220104******282376
        220421******151442
        ..................
'''

info={'11':'北京市','12':'天津市','13':'河北省','14':'山西省','15':'内蒙古自治区',
      '22':'吉林省','23':'黑龙江省','31':'上海市', '32':'江苏省','33':'浙江省','35':'福建省',
      '36':'江西省','37':'山东省','41':'河南省','42':'湖北省','44':'广东省','45':'广西壮族自治区',
      '46':'海南省','50':'重庆市','51':'四川省','53':'云南省','54':'西藏自治区',
      '61':' 陕西省 ','62':' 甘肃省 ','63':' 青海省 ','65':' 新疆维吾尔自治区 ','71':' 台湾省',
      '81':'香港','82':'澳门' }
card=[]
pre=[]
with open('e://06_workspace//jobspace//pythonDemo//tmp//sfzdm.txt','r',encoding='utf-8') as files:
    # 1.循环读取sfzdm.txt文件中每一行的内容，若读为空则跳出循环表示读完
     while True:
            line=files.readline().strip()
            if line =='':
                break
            # 2.将号码放在空列表中，将号码前两位数字放在空列表
            card.append(line)
            pre.append(line[0:2])
    # 3.连个列表中的数字进行排序
card.sort()
pre=list(set(pre))            # set(): set('work')-->{'w','o','r','k'}
pre.sort(key=lambda x:int(x)) # pre.sort(key=lambda x:x[0])
mystr=""
for item in pre:
    # 4.根据info字典中的键获取字典中的值，循环输出对应的省份
    instr=info.get(item)
    # 5.将所有省份居中，以15个空格填充,放在一个空字符串中mystr
    print(instr.center(15))
    mystr+=instr.center(15)+"\n"
    # 6.若card排序的前两数字与item排序前两位数相等,则输出打印,放在一个空字符串中mystr
    for each in card:
        if each[0:2]==item:
            print(each)
            mystr+=each+"\n"
    # 7.将mystr对象写到指定文件中
with open('e://06_workspace//jobspace\pythonDemo//tmp//pre.txt','w') as files:
    files.write(mystr)