'''
    1.实现根据出生日期判断你的星座,根据用户输入的公历日期,判断属于哪个星座,并输出该星座的标志
    2.星座对应表如下：
        标志          星座                  出生日期(公历)
        ♑           魔蝎座                12月22日~1月19日
        ♒           水瓶座                 1月20日~2月18日
        ♓            双鱼座                 2月19日~3月20日
        ♈           白羊座                 3月21日~4月19日
        ♉           金牛座                 4月20日~5月20日
        ♊           双子座                 5月21日~6月21日
        ♋           巨蟹座                 6月22日~7月22日
        ♌           狮子座                 7月23日~8月22日
        ♍           处女座                 8月23日~9月22日
        ♎           天秤座                 9月23日~10月23日
        ♏           天蝎座                 10月24日~11月22日
        ♐           射手座                 11月23日~12月21日
'''

date = [20, 19, 21, 20, 21, 22, 23, 23, 23, 24, 23, 22]
star = ["摩羯座", "水瓶座", "双鱼座", "白羊座", "金牛座", "双子座", "巨蟹座", "狮子座", "处女座", "天秤座", "天蝎座", "射手座"]
signs = ['♑', '♒', '♓', '♈', '♉', '♊', '♋', '♌', '♍', '♎', '♏', '♐']
type = ['务实本分', '作天作地', '安于现状', '积极乐观', '固执内向', '圆滑世故', '多愁善感', '迷之自信', '精明计较', '犹豫不决', '阴暗消极', '放荡不羁', '务实本分']

birth = input('请输入你的出生年月日,格式为：2020-12-12或2000-2-21\n').strip(' ')
cbir = birth.split('-')
cmonth = str(cbir[1])
cdate = str(cbir[2])


def issign(cmonth, cdate):
    if int(cdate) < date[int(cmonth) - 1]:  # date[int(02)-1]    --> 19
        print(star[int(cmonth) - 1])  # star[int(02)-1]    --> 水瓶座
        print(signs[int(cmonth) - 1])  # signs[int(02)-1]   --> ♒
        print(type[int(cmonth) - 1])  # type[int(02)-1]    -->作天作地
    else:
        print(star[int(cmonth)])
        print(signs[int(cmonth)])
        print(type[int(cmonth)])


issign(cmonth, cdate)
