'''
    1.实现根据出生日期判断你的星座,根据用户输入的公历日期,判断属于哪个星座,并输出该星座的标志
    2.星座对应表如下：
        标志          星座                  出生日期(公历)
        ♑           魔蝎座                12月22日~1月19日
        ♒           水瓶座                 1月20日~2月18日
        ♓            双鱼座                 2月19日~3月20日
        ♈           白羊座                 3月21日~4月19日
        ♉           金牛座                 4月20日~5月20日
        ♊           双子座                 5月21日~6月21日
        ♋           巨蟹座                 6月22日~7月22日
        ♌           狮子座                 7月23日~8月22日
        ♍           处女座                 8月23日~9月22日
        ♎           天秤座                 9月23日~10月23日
        ♏           天蝎座                 10月24日~11月22日
        ♐           射手座                 11月23日~12月21日
'''

sdate = [21, 20, 21, 21, 22, 22, 23, 24, 24, 24, 23, 22]          # 星座判断列表
conts = ['摩羯座', '水瓶座', '双鱼座', '白羊座', '金牛座', '双子座', '巨蟹座', '狮子座', '处女座', '天秤座', '天蝎座', '射手座', '摩羯座']
signs = ['♑', '♒', '♓', '♈', '♉', '♊', '♋', '♌', '♍', '♎', '♏', '♐', '♑']
type = ['务实本分', '作天作地', '安于现状', '积极乐观', '固执内向', '圆滑世故', '多愁善感', '迷之自信', '精明计较', '犹豫不决', '阴暗消极', '放荡不羁', '务实本分']

birth = input('请输入你的出生年月日,格式为：2020-12-12或2000-2-21\n').strip(' ')
cbir = birth.split('-')
cmonth = str(cbir[1])
cdate = str(cbir[2])


def issign(cmonth, cdate):
    if int(cdate) < sdate[int(cmonth) - 1]:  # date[int(02)-1]    --> 19
        print(conts[int(cmonth) - 1])        # star[int(02)-1]    --> 水瓶座
        print(signs[int(cmonth) - 1])        # signs[int(02)-1]   --> ♒
        print(type[int(cmonth) - 1])         # type[int(02)-1]    -->作天作地
    else:
        print(conts[int(cmonth)])
        print(signs[int(cmonth)])
        print(type[int(cmonth)])


issign(cmonth, cdate)

# sdate = [21, 20, 21, 21, 22, 22, 23, 24, 24, 24, 23, 22]  # 星座判断列表
# conts = ['摩羯座', '水瓶座', '双鱼座', '白羊座', '金牛座', '双子座', '巨蟹座', '狮子座', '处女座', '天秤座', '天蝎座', '射手座', '摩羯座']
# signs = ['♑', '♒', '♓', '♈', '♉', '♊', '♋', '♌', '♍', '♎', '♏', '♐', '♑']
#
# # 输入生日,输出星座
# birth = input('请输入你的出生年月日,格式为:2001-02-21\n').strip(' ')
# cbir = birth.split('-')  # 分割年月日到列表
# cmonth = str(cbir[1])    # 提取月数据
# cdate = str(cbir[2])     # 提取日数据
#
#
# def sign(cmonth, cdate):  # 判断星座函数
#     if int(cdate) < sdate[int(cmonth) - 1]:  # 如果日数据早于对应月列表中对应的日期
#         print(conts[int(cmonth) - 1])  # 直接输出星座列表对应月对应的星座
#         print(signs[int(cmonth) - 1])  # 直接输出星座列表对应月对应的星座
#     else:
#         print(conts[int(cmonth)])  # 否则输出星座列表下一月对应的星座
#         print(signs[int(cmonth)])  # 否则输出星座列表下一月对应的星座
#
#
# sign(cmonth, cdate)  # 调用星座判断程序
